#+STARTUP: showall
#+STARTUP: lognotestate
#+TAGS:
#+SEQ_TODO: TODO STARTED DONE DEFERRED CANCELLED | WAITING DELEGATED APPT
#+DRAWERS: HIDDEN STATE
#+TITLE: C++ notes for CoP
#+CATEGORY: 
#+PROPERTY: header-args:sql             :engine postgresql  :exports both :cmdline csc370
#+PROPERTY: header-args:sqlite          :db /path/to/db  :colnames yes
#+PROPERTY: header-args:C++             :results output :flags -std=c++14 -Wall --pedantic -Werror
#+PROPERTY: header-args:R               :results output  :colnames yes
#+OPTIONS: ^:nil

** Descending

#+BEGIN_SRC C++
#include <iostream>
#include <queue>
#include <vector>
#include <algorithm>

int main()
{
   std::priority_queue<int> q;
   for(int n : {1,8,5,6,3,4,0,9,7,2})
     q.push(n);
   for(int i = 0;i<10;i++) {
      std::cout << q.top() << std::endl;
      q.pop();
   }
   return 0;
}
#+END_SRC

#+RESULTS:
| 9 |
| 8 |
| 7 |
| 6 |
| 5 |
| 4 |
| 3 |
| 2 |
| 1 |
| 0 |

** join


this is wayyy better...

#+BEGIN_SRC C++ :results output
#include <iostream>
#include <iterator>
#include <algorithm>
#include <vector>

int main()
{
    std::vector<std::string> vec {"This", "is", "the", "sea"};

    copy(vec.begin(),vec.end(), std::ostream_iterator<std::string>(std::cout," "));

    return 0;
}
#+END_SRC

#+RESULTS:
#+begin_example
This is the sea
#+end_example

#+BEGIN_SRC C++ :results output
#include <iostream>
#include <iterator>
#include <vector>
#include <algorithm>
#include <functional>
#include <numeric>

std::string join(std::vector<std::string> &vec, std::string sep=" ") 
{

// this might be inefficient
   std::string s = std::accumulate(std::begin(vec), std::end(vec), std::string(),
                                [&](std::string &ss, std::string &s)
                                {
                                    return ss.empty() ? s : ss + sep + s;
                                });

   return s;
}

std::string join2(std::vector<std::string> &vec, std::string sep=" ") 
{

// this might be inefficient
   std::string s;
   std::for_each(std::begin(vec), std::end(vec), 
                 [&](std::string &ss) {
                     if (s.empty()) {
                         s = ss;
                     } else {
                         s += sep + ss;
                     }
                 });

   return s;
}


int main()
{
    std::vector<std::string> vec {"This", "is", "the", "sea"};

    std::cout << "[" ;

    copy(vec.begin(),vec.end(), std::ostream_iterator<std::string>(std::cout," "));

    std::cout << "]" << std::endl;
    std::cout << "[" << join(vec) << "]" << std::endl;
    std::cout << "[" << join2(vec) << "]" << std::endl;
    return 0;
}
#+END_SRC

#+RESULTS:
#+begin_example
[This is the sea ]
[This is the sea]
[This is the sea]
#+end_example



